PureBulb/stm32_CompositeDevice/Middlewares/ST/STM32_USB_Device_Library/Class/CDC/Src/usbd_cdc.c
    /* Get the received data length */
    hcdc->RxLength = USBD_LL_GetRxDataSize(pdev, epnum);

    /* USB data will be immediately processed, this allow next USB traffic being
    NAKed till the end of the application Xfer */
    if (pdev->pClassData[interfaceIndex] != NULL)
    {
        ((USBD_CDC_ItfTypeDef*)pdev->pUserData[interfaceIndex])
            ->Receive(hcdc->RxBuffer, &hcdc->RxLength);

        return USBD_OK;
    }
    else
    {
        return USBD_FAIL;
    }
}

/**
 * @brief  USBD_CDC_EP0_RxReady
 *         Handle EP0 Rx Ready event
 * @param  pdev: device instance
 * @retval status
 */
static uint8_t USBD_CDC_EP0_RxReady(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    int8_t interfaceIndex = USBD_CDC_GetInterfaceIndexByEpNum(pdev, epnum);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }
    USBD_CDC_HandleTypeDef* hcdc =
        (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];

    if ((pdev->pUserData[interfaceIndex] != NULL) && (hcdc->CmdOpCode != 0xFFU))
    {
        ((USBD_CDC_ItfTypeDef*)pdev->pUserData[interfaceIndex])
            ->Control(hcdc->CmdOpCode, (uint8_t*)(void*)hcdc->data,
                      (uint16_t)hcdc->CmdLength);
        hcdc->CmdOpCode = 0xFFU;
    }
    return USBD_OK;
}

/**
 * @brief  USBD_CDC_GetFSCfgDesc
 *         Return configuration descriptor
 * @param  speed : current device speed
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
static uint8_t* USBD_CDC_GetFSCfgDesc(uint16_t* length)
{
    *length = sizeof(USBD_CDC_CfgFSDesc);
    return USBD_CDC_CfgFSDesc;
}

/**
 * @brief  USBD_CDC_GetHSCfgDesc
 *         Return configuration descriptor
 * @param  speed : current device speed
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
static uint8_t* USBD_CDC_GetHSCfgDesc(uint16_t* length)
{
    *length = sizeof(USBD_CDC_CfgHSDesc);
    return USBD_CDC_CfgHSDesc;
}

/**
 * @brief  USBD_CDC_GetCfgDesc
 *         Return configuration descriptor
 * @param  speed : current device speed
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
static uint8_t* USBD_CDC_GetOtherSpeedCfgDesc(uint16_t* length)
{
    *length = sizeof(USBD_CDC_OtherSpeedCfgDesc);
    return USBD_CDC_OtherSpeedCfgDesc;
}

/**
 * @brief  DeviceQualifierDescriptor
 *         return Device Qualifier descriptor
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
uint8_t* USBD_CDC_GetDeviceQualifierDescriptor(uint16_t* length)
{
    *length = sizeof(USBD_CDC_DeviceQualifierDesc);
    return USBD_CDC_DeviceQualifierDesc;
}

/**
 * @brief  USBD_CDC_RegisterInterface
 * @param  pdev: device instance
 * @param  fops: CD  Interface callback
 * @retval status
 */
uint8_t USBD_CDC_RegisterInterface(USBD_HandleTypeDef* pdev,
                                   USBD_CDC_ItfTypeDef* fops)
{
    uint8_t ret = USBD_FAIL;

    if (fops != NULL)
    {
        uint16_t configDesctiptorLen;
        CDC_Parse_Configuration(
            pdev, fops,
            pdev->pClass->GetFSConfigDescriptor(&configDesctiptorLen),
            configDesctiptorLen);
        ret = USBD_OK;
    }

    return ret;
}

/**
 * @brief  USBD_CDC_SetTxBuffer
 * @param  pdev: device instance
 * @param  pbuff: Tx Buffer
 * @retval status
 */
uint8_t USBD_CDC_SetTxBuffer(USBD_HandleTypeDef* pdev, uint8_t* pbuff,
                             uint16_t length)
{
    USBD_CDC_HandleTypeDef* hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData[0];

    hcdc->TxBuffer = pbuff;
    hcdc->TxLength = length;

    return USBD_OK;
}

/**
 * @brief  USBD_CDC_SetRxBuffer
 * @param  pdev: device instance
 * @param  pbuff: Rx Buffer
 * @retval status
 */
uint8_t USBD_CDC_SetRxBuffer(USBD_HandleTypeDef* pdev, uint8_t* pbuff)
{
    USBD_CDC_HandleTypeDef* hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData[0];

    hcdc->RxBuffer = pbuff;

    return USBD_OK;
}

/**
 * @brief  USBD_CDC_TransmitPacket
 *         Transmit packet on IN endpoint
 * @param  pdev: device instance
 * @retval status
 */
uint8_t USBD_CDC_TransmitPacket(USBD_HandleTypeDef* pdev)
{
    int8_t interfaceIndex = USBD_CDC_GetInterfaceIndexByEpNum(pdev, CDC_IN_EP);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }
    USBD_CDC_HandleTypeDef* hcdc =
        (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];

    if (pdev->pClassData[interfaceIndex] != NULL)
    {
        if (hcdc->TxState == 0U)
        {
            /* Tx Transfer in progress */
            hcdc->TxState = 1U;

            /* Update the packet total length */
            pdev->ep_in[CDC_IN_EP & 0xFU].total_length = hcdc->TxLength;

            /* Transmit next packet */
            USBD_LL_Transmit(pdev, CDC_IN_EP, hcdc->TxBuffer,
                             (uint16_t)hcdc->TxLength);

            return USBD_OK;
        }
        else
        {
            return USBD_BUSY;
        }
    }
    else
    {
        return USBD_FAIL;
    }
}

/**
 * @brief  USBD_CDC_ReceivePacket
 *         prepare OUT Endpoint for reception
 * @param  pdev: device instance
 * @retval status
 */
uint8_t USBD_CDC_ReceivePacket(USBD_HandleTypeDef* pdev)
{
    int8_t interfaceIndex = USBD_CDC_GetInterfaceIndexByEpNum(pdev, CDC_OUT_EP);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }
    USBD_CDC_HandleTypeDef* hcdc =
        (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];
    /* Suspend or Resume USB Out process */
    if (pdev->pClassData[interfaceIndex] != NULL)
    {
        if (pdev->dev_speed == USBD_SPEED_HIGH)
        {
            /* Prepare Out endpoint to receive next packet */
            USBD_LL_PrepareReceive(pdev, CDC_OUT_EP, hcdc->RxBuffer,
                                   CDC_DATA_HS_OUT_PACKET_SIZE);
        }
        else
        {
            /* Prepare Out endpoint to receive next packet */
            USBD_LL_PrepareReceive(pdev, CDC_OUT_EP, hcdc->RxBuffer,
                                   CDC_DATA_FS_OUT_PACKET_SIZE);
        }
        return USBD_OK;
    }
    else
    {
        return USBD_FAIL;
    }
}
/**
 * @}
 */
int8_t USBD_CDC_GetInterfaceIndexByEpNum(USBD_HandleTypeDef* pdev,
                                         uint8_t ep_addr)
{
    ep_addr &= EP_ADDR_MSK;
    for (int8_t i = 0; i < pdev->interfaceSize; i++)
    {
        USBD_CDC_ItfTypeDef* fops = pdev->pUserData[i];
        for (int8_t epIndex = 0; epIndex < fops->endpointSize; epIndex++)
        {
            uint8_t epAddr = fops->interfaceEpAddr[epIndex];
            if (epAddr == ep_addr)
            {
                return i;
            }
        }
    }
    return -1;
}
int8_t USBD_CDC_GetInterfaceIndexByIfNum(USBD_HandleTypeDef* pdev,
                                         uint8_t if_num)
{
    for (int8_t i = 0; i < pdev->interfaceSize; i++)
    {
        USBD_CDC_ItfTypeDef* fops = pdev->pUserData[i];
        for (int8_t j = 0; j < fops->interfaceSize; j++)
        {
            uint8_t interfaceNum = fops->interfaceNumbers[j];
            if (interfaceNum == if_num)
            {
                return i;
            }
        }
    }
    return -1;
}

int8_t CDC_Parse_Configuration(USBD_HandleTypeDef* pdev,
                               USBD_CDC_ItfTypeDef* fops, uint8_t* cfgData,
                               uint16_t length)
{
    uint8_t seek = 0;
    uint8_t ret = USBD_OK;
    USBD_CDC_ItfTypeDef* succRegFops = NULL;
    uint8_t endpointNum = 0;
    while (seek < length)
    {
        uint8_t descLen = cfgData[seek];
        uint8_t descType = cfgData[seek + 1];
        switch (descType)
        {
            case USB_DESC_TYPE_INTERFACE:
                succRegFops = NULL;
                ret = CDC_Parse_Interface(pdev, fops, &cfgData[seek],
                                          &endpointNum);
                succRegFops = (ret == USBD_OK) ? fops : succRegFops;
                seek += descLen;
                break;
            case USB_DESC_TYPE_ENDPOINT:
                if (endpointNum != 0)
                    ret = CDC_Parse_Endpoint(succRegFops, &cfgData[seek]);
                seek += descLen;
                endpointNum--;
                if (endpointNum == 0) succRegFops = NULL;
                break;
            default:
                seek += descLen;
                break;
        }
        if (ret != USBD_OK) break;
    }
    return ret;
}
int8_t CDC_Parse_Interface(USBD_HandleTypeDef* pdev, USBD_CDC_ItfTypeDef* fops,
                           uint8_t* interfaceData, uint8_t* endpointNum)
{
    *endpointNum = 0;
    int8_t isFind = 0;
    uint8_t interfaceClassType = interfaceData[5];
    for (uint8_t i = 0; i < INTERFACE_MAX_EP_NUM; i++)
    {
        if (fops->interfaceClassType[i] != 0 &&
            fops->interfaceClassType[i] == interfaceClassType)
        {
            isFind = 1;
            break;
        }
    }
    if (isFind)
    {
        fops->interfaceNumbers[fops->interfaceSize++] = interfaceData[2];
        *endpointNum = interfaceData[4];
        // Found CDC Interface
        if (fops->isRegistered != 0u)
        {
            return USBD_OK;
        }
        fops->isRegistered = 1;
        pdev->pUserData[pdev->interfaceSize++] = fops;

        return USBD_OK;
    }
    return USBD_FAIL;
}
int8_t CDC_Parse_Endpoint(USBD_CDC_ItfTypeDef* fops, uint8_t* endpointData)
{
    if (NULL == fops) return USBD_OK;
    if (fops->endpointSize >= INTERFACE_MAX_EP_NUM) return USBD_FAIL;
    fops->interfaceEpAddr[fops->endpointSize++] = endpointData[2];
    fops->interfaceEpAttr[fops->endpointSize - 1] = endpointData[3];
    return USBD_OK;
}
/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
